---
title: "Convert A Categorical Variable Into Dummy Variables"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "Convert A Categorical Variable Into Dummy Variables."
type: technical_note
draft: false
---

In [1]:
# import modules
import pandas as pd

In [2]:
# Create a dataframe
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'sex': ['male', 'female', 'male', 'female', 'female']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'sex'])
df

  first_name last_name     sex
0      Jason    Miller    male
1      Molly  Jacobson  female
2       Tina       Ali    male
3       Jake    Milner  female
4        Amy     Cooze  female

In [3]:
# Create a set of dummy variables from the sex variable
df_sex = pd.get_dummies(df['sex'])

In [4]:
# Join the dummy variables to the main dataframe
df_new = pd.concat([df, df_sex], axis=1)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male     0.0   1.0
1      Molly  Jacobson  female     1.0   0.0
2       Tina       Ali    male     0.0   1.0
3       Jake    Milner  female     1.0   0.0
4        Amy     Cooze  female     1.0   0.0

In [5]:
# Alterative for joining the new columns
df_new = df.join(df_sex)
df_new

  first_name last_name     sex  female  male
0      Jason    Miller    male     0.0   1.0
1      Molly  Jacobson  female     1.0   0.0
2       Tina       Ali    male     0.0   1.0
3       Jake    Milner  female     1.0   0.0
4        Amy     Cooze  female     1.0   0.0